In [1]:
import numpy as np
import pandas as pd

s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [2]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [3]:
#Series + Series
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [5]:
s1.add(s2,fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

In [11]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [12]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [13]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [19]:
frame1 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['高雄','台北','台中','台南'])
frame1

      b     d     e
高雄  0.0   1.0   2.0
台北  3.0   4.0   5.0
台中  6.0   7.0   8.0
台南  9.0  10.0  11.0

In [20]:
frame2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('acf'),
                     index=['高雄','台北','台中','台南'])
frame2

      a     c     f
高雄  0.0   1.0   2.0
台北  3.0   4.0   5.0
台中  6.0   7.0   8.0
台南  9.0  10.0  11.0

In [21]:
frame1 + frame2

     a   b   c   d   e   f
高雄 NaN NaN NaN NaN NaN NaN
台北 NaN NaN NaN NaN NaN NaN
台中 NaN NaN NaN NaN NaN NaN
台南 NaN NaN NaN NaN NaN NaN

In [22]:
frame1.add(frame2,fill_value=0)

      a    b     c     d     e     f
高雄  0.0  0.0   1.0   1.0   2.0   2.0
台北  3.0  3.0   4.0   4.0   5.0   5.0
台中  6.0  6.0   7.0   7.0   8.0   8.0
台南  9.0  9.0  10.0  10.0  11.0  11.0

In [23]:
frame1 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['高雄','台北','台中','台南'])
frame1

      b     d     e
高雄  0.0   1.0   2.0
台北  3.0   4.0   5.0
台中  6.0   7.0   8.0
台南  9.0  10.0  11.0

In [25]:
s1=pd.Series([1.0, 1.0, 1.0, 1.0],index=['高雄','台北','台中','台南'])
s1

高雄    1.0
台北    1.0
台中    1.0
台南    1.0
dtype: float64

In [27]:
frame1.add(s1,axis='index')

       b     d     e
高雄   1.0   2.0   3.0
台北   4.0   5.0   6.0
台中   7.0   8.0   9.0
台南  10.0  11.0  12.0

In [28]:
s2=pd.DataFrame([1.0, 1.0, 1.0, 1.0],columns=['b'],index=['高雄','台北','台中','台南'])
s2

      b
高雄  1.0
台北  1.0
台中  1.0
台南  1.0

In [30]:
frame1.add(s2,fill_value=0)

       b     d     e
高雄   1.0   1.0   2.0
台北   4.0   4.0   5.0
台中   7.0   7.0   8.0
台南  10.0  10.0  11.0